app/views/authors/home.html.erb

<%= pr.descripti%>
<%= image_tag pr.images.first.photo%>
---
SELECT "images".* FROM "images"