app/controllers/authors_controller.rb

  def index
@author=Author.paginate(:per_page => 5, :page => params[:page])
---
SELECT  "authors".* FROM "authors"  LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "authors"

  def create
    	params.permit!
   #@author=Author.new(params[:author])
   @author=Author.new(:name=>params[:author][:name],:email=>params[:author][:email])
   respond_to do |format|
   if @author.save
      @image=Image.create(params[:author][:image])
---
INSERT INTO "authors" ("created_at", "email", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-01-13 15:13:48.530783"], ["email", "gmail"], ["name", "vinesh"], ["updated_at", "2015-01-13 15:13:48.530783"]]
INSERT INTO "images" ("created_at", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def edit
    @author=Author.find(params[:id])
---
SELECT  "authors".* FROM "authors"  WHERE "authors"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    params.permit!
   @author=Author.find(params[:id])
   if @author.update_attributes(params[:author])
---
SELECT  "authors".* FROM "authors"  WHERE "authors"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "authors" SET "email" = $1, "name" = $2, "updated_at" = $3 WHERE "authors"."id" = 1  [["email", "tech1@gmail.com"], ["name", "tectra1"], ["updated_at", "2015-01-19 20:49:46.748449"]]

  def destroy
   @author=Author.find(params[:id])
   if @author.delete
---
SELECT  "authors".* FROM "authors"  WHERE "authors"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "authors" WHERE "authors"."id" = 1

  def home
    @image=Image.all
    @product=Product.all
    @author=Author.all
---
SELECT "images".* FROM "images"
SELECT "products".* FROM "products"
SELECT "authors".* FROM "authors"