app/controllers/images_controller.rb

def index
	@image=Image.all
---
SELECT "images".* FROM "images"

def create
params.permit!
@image=Image.new(params[:image])
  if @image.save
---
INSERT INTO "images" ("created_at", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"