app/controllers/products_controller.rb

  def index
  @product=Product.all
---
SELECT "products".* FROM "products"

def seo_url
@product=Product.find_by_id_and_title(params[:id],params[:product_name])
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = 9 AND "products"."title" = 'jeans' LIMIT 1

  def create
  	params.permit!
  	@product=Product.new(:title=>params[:product][:title],:descripti=>params[:product][:descripti],:price=>params[:product][:price])
    if @product.save
      @image=Image.create(params[:product][:image])
---
INSERT INTO "products" ("created_at", "descripti", "price", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-02-05 15:56:12.299398"], ["descripti", "from spykar"], ["price", 200.0], ["title", "jeans"], ["updated_at", "2015-02-05 15:56:12.299398"]]
INSERT INTO "images" ("created_at", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def add_image
    @product=Product.find(params[:id])
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = $1 LIMIT 1  [["id", 2]]

  def save_image
  params.permit!
    @image=Image.new(params[:product])
    byebug
    if @image.save
       @image.update_attributes(:entity=>Product.find(params[:id]))
---
INSERT INTO "images" ("created_at", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  "products".* FROM "products"  WHERE "products"."id" = $1 LIMIT 1  [["id", 7]]
UPDATE "images" SET "entity_id" = $1, "entity_type" = $2, "updated_at" = $3 WHERE "images"."id" = 24  [["entity_id", 7], ["entity_type", "Product"], ["updated_at", "2015-01-31 08:32:18.078621"]]