app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-01-27 15:02:02.464432"], ["email", "kiruba@gmail.com"], ["name", "Kiruba"], ["password", "12345"], ["updated_at", "2015-01-27 15:02:02.464432"]]
---
  def create
    	params.permit!

   @user=User.new(params[:user])
   if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."email" = 'kiruba@gmail.com' AND "users"."password" = '12345' LIMIT 1
---
  def allow_login
  	@user=User.check_enc_password(params[:user][:email],params[:user][:password])
  	if @user.present?